{
    "count": 10,
    "news": [
        {
            "title": "'Listen to Michigan' protesters exceed expectations, send message to Biden in key battleground state",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/Biden_Hammoud.png",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/KJP-1.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/1f2cf510-469f-40a3-bc8d-f8f5b96dca0f/41c27ba0-ecb3-4441-b765-2122cc8eee08/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/AP24043620234064.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/01/1200/675/biden-trump-split.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/Biden_Hammoud.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/Biden_Hammoud.png?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/listen-tomichigan-protesters-exceed-expectations-send-message-biden-key-battleground-state",
            "date": "Wed, 28 Feb 2024 19:57:00 GMT",
            "short_description": "'Listen to Michigan' protesters exceed expectations, send message to Biden in key battleground state  Fox News",
            "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nA group of Democrats who started a movement in opposition to President Biden's support for Israel's war in Gaza sent a clear message in the Michigan primary, exceeding the amount of votes the group was aiming for and complicating the key battleground state ahead of this year's general election.\n\n\"Yesterday was a resounding victory,\" Dearborn Mayor Abdullah Hammoud, who joined the \"Listen to Michigan\" movement, said during a news conference Wednesday claiming victory for the movement.\n\nThe comments come following the movement's push to have Democratic voters select \"uncommitted\" in Tuesday's Democratic primary surpassed the group's expectations, with just over 101,000 people selecting the option, according to Associated Press numbers as of Wednesday afternoon. That mark was more than 10 times the group's stated goal, which was to get 10,000 people, or roughly the same as the margin of victory in the 2016 election in the state, to select the option.\n\nPOLL SHOWS BIDEN'S LEAD OVER TRUMP SHRINKING IN 2024 MATCHUP AS CONCERNS OVER PHYSICAL FITNESS GROW\n\nDespite the apparent resounding success, Biden easily captured the state and gained 115 delegates while hauling in over 81% of the vote, further solidifying his grasp on the nomination and setting up a likely rematch with former President Donald Trump in November.\n\n\"I want to thank every Michigander who made their voice heard today. Exercising the right to vote and participating in our democracy is what makes America great,\" Biden said in a statement after the Michigan victory while warning that there is \"much left to do\" to defeat Trump in November. \"You’ve heard me say many times it’s never a good bet to bet against the United States of America. It’s never a good bet to bet against Michiganders either. This fight for our freedoms, for working families, and for Democracy is going to take all of us coming together. I know that we will.\"\n\nMeanwhile, Listen to Michigan supporters have warned they are willing to continue growing the movement ahead of the general election, a potential headache for the Biden campaign in a battleground state that has seen close margins in the last two presidential elections.\n\nJAMES CARVILLE FRETS OVER 'UNCOMMITTED' PROTEST VOTE AGAINST BIDEN IN MICHIGAN: 'HUGE PROBLEM'\n\nReached for comment by Fox News Digital, a Biden campaign spokesperson noted that the share of uncommitted votes, 11%, was actually in line with the previous time an incumbent was on the ballot in the state in a Democratic primary, which was during the 2012 re-election campaign of Former President Barack Obama. Nevertheless, the spokesperson stressed that the campaign is still working hard to earn the votes of holdouts and will continue working towards peace in Gaza.\n\nBut the movement started by Listen to Michigan may not be in Biden's rearview mirror after Michigan, with the group saying activists in future primary states have reached out about joining the cause.\n\n\"Two of the states where organizers have reached out specifically are Minnesota and Washington State,\" a Listen to Michigan spokesperson said during Wednesday's news conference. \"We have our eye on those states… and are ready to have conversations with anybody organizing for an anti-war future.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe organization has also brushed off suggestions that it may at least indirectly help Trump regain the presidency, arguing that it is up to Biden to earn their votes.\n\n\"We are not electing Donald Trump. President Biden is the one seeking the highest office, and he is the candidate who's facing off against Donald Trump,\" Hammoud said. \"He has to earn the votes of the constituency that he's trying to serve.\"",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Hamas officials shut down Biden's ice cream diplomacy, rejects cease-fire deal",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/Biden-Ice-Cream.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/tank-Israel-Hamas-war.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/133a9053-4fec-4aa4-a4e7-ca51bc0705f0/c63b5e90-e829-4004-a230-40cd4e013894/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/01/1200/675/GettyImages-1944714824.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/Biden-Ice-Cream.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/Biden-Ice-Cream.jpg",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/AP24059679895953.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/hamas-officials-shut-down-bidens-ice-cream-diplomacy-rejects-cease-fire-deal",
            "date": "Wed, 28 Feb 2024 12:05:00 GMT",
            "short_description": "Hamas officials shut down Biden's ice cream diplomacy, rejects cease-fire deal  Fox News",
            "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nPresident Biden's predictions of a cease-fire agreement between Hamas and Israel are looking too sweet to be true, with multiple Hamas officials rejecting the current deal.\n\nBiden predicted between licks of an ice cream cone on Monday that Hamas would accept a deal with Israel in the coming days, but statements from Hamas officials show little hope of progress.\n\n\"I hope by… the end of the weekend,\" Biden said Monday with cone in hand. \"My national security advisor tells me we’re close. We’re close. It’s not one yet. My hope is by next Monday, we’ll have a cease-fire.\"\n\nMeanwhile, multiple Hamas officials indicated on Tuesday and Wednesday that no breakthrough in negotiations had been made, according to The New York Times.\n\nISRAELI SECURITY EXPERTS SAY BIDEN’S PALESTINIAN STATE PUSH IS AN ’EXISTENTIAL THREAT’\n\n\"We are not interested in engaging with what’s been floated, because it does not fulfill our demands,\" Hamas official Ahmad Abdelhadi said in an interview with a Lebanese broadcaster.\n\nBIDEN TO GO TO UN SECURITY COUNCIL TO FORCE TEMPORARY CEASE-FIRE ON ISRAEL, HALT RAFAH OFFENSIVE\n\nMore concerning, Hamas spokesman Basem Naim said the terrorist organization had not even received \"any new proposals\" since the parties met last week.\n\nHamas is not the only party warning Biden to pump the brakes. Qatar, which has played a major role throughout the negotiations, indicated on Tuesday that there is no deadline for an agreement.\n\n\"The efforts are ongoing; all the parties are conducting regular meetings,\" Qatari Foreign Ministry spokesman Majed al-Ansari told reporters, according to NYT. \"But for now, while we certainly hope it will be achieved as soon as possible, we don’t have anything in our hands so as to comment on that deadline.\"\n\nMeanwhile, Israel is deep in the planning process for an expected invasion of Rafah, the Gaza town on the border with Egypt that plays host to both the final remnants of Hamas and key routes for aid.\n\nIsraeli Prime Minister Benjamin Netanyahu said an invasion would proceed at some point regardless of whether a cease-fire agreement is reached.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"If we have a deal, it will be delayed somewhat, but it will happen. If we don't have a deal, we'll do it anyway,\" Netanyahu said of the Rafah operation.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Supreme Court divided over federal ban on bump stock gun accessory",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/06/US-Supreme-Court.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/05/340/340/Bream_Shannon_OFFICIAL.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/06/US-Supreme-Court.jpg",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/c37e64ba-b502-4b2b-b82b-298adf43a2af/ac108be6-affa-4aae-91b8-e59dbf645746/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/06/1200/675/US-Supreme-Court.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/01/1200/675/bump-stock-gun-accessory-firearms.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/01/1200/675/Supreme-Court-Justices-Photo-1.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/AP24059679895953.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/supreme-court-divided-over-federal-ban-bump-stock-gun-accessory",
            "date": "Wed, 28 Feb 2024 21:04:00 GMT",
            "short_description": "Supreme Court divided over federal ban on bump stock gun accessory  Fox News",
            "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nThe Supreme Court offered divided thoughts and a measure of confusion on Wednesday over whether the federal government can ban so-called bump stocks, a device that increases the firepower of automatic weapons.\n\nThe case, Garland v. Cargill, presents whether a \"bump stock\" device is a \"machine gun\" as defined by federal law because it is designed and intended for use in converting a rifle into a weapon that fires \"automatically more than one shot... by a single function of the trigger.\"\n\nAfter a 2017 mass shooting in Las Vegas that left 60 people dead and 500 more wounded, the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) issued an interpretive rule concluding that \"bump stocks\" are machine guns.\n\nThe Trump administration initiated a ban on the devices – reversing earlier regulations – and the Biden Justice Department is now defending it in court.\n\nGOP SENATOR INTRODUCES BILL TO DEFEND GUN DEALERS FROM BIDEN'S 'GUN-GRABBING AGENDA': 'EXTREMIST POLICIES'\n\nMichael Cargill, owner of Central Texas Gun Works, sued the government after he was forced to surrender several \"bump stocks\" under the ATF's rule. He says the agency overstepped its administrative authority to impose a ban, absent any congressional action.\n\n\"It really goes back to… freedom. And it goes back to just the basics of something that my customers and myself legally purchase. The government should not have that power, that authority in an administrative agency… to come back and ban that. You know, something that Congress has not banned. That's going to be a job that's reserved for Congress ,\" Cargill said in an interview with Fox News Digital.\n\nThe conservative high court majority has been generally supportive of the Second Amendment in recent years, and several justices suggested the government here overstepped its power.\n\nBut the nearly 90 minutes of oral arguments signaled the nine-member bench viewed the case as more about regulatory authority and less about expanded gun rights.\n\nThe justices' questions were focused mainly on exactly how bump stocks work, and their functional effect.\n\n\"I can certainly understand why these items should be made illegal, but we're dealing with a statute that was enacted in the 1930s, and through many administrations, the government took the position that these bump stocks are not machine guns,\" said Justice Neil Gorsuch. \"And then you adopted an interpretive rule, not even a legislative rule, saying otherwise that would render between a quarter of a million and a half million people federal felons.\"\n\nJustice Samuel Alito called that \"disturbing.\"\n\n\"These are the kind of weapons that Congress was intending to prohibit because of the damage they cause,\" said Justice Ketanji Brown Jackson. \"It's really not about the operation of the thing. It's about what it can achieve, what it's being used for... The function of this trigger is to cause this kind of damage, 800 rounds a second or whatever.\"\n\nA bump stock is an attachment that replaces an automatic weapon's standard stock, the part of the long weapon that rests on the shoulder.\n\nTEXAS GUN STORE OWNER SAYS SUPREME COURT SHOULD LIMIT GOVERNMENT 'POWER' IN 'BUMP STOCK' BAN CASE\n\nAs the shooter applies forward thrust on the barrel, the device harnesses the recoil energy so that the trigger will \"bump\" against the stationary finger, which then allows another round to be fired. The effect is more rapid shots than with a standard stock, up to 800 bullets a minute.\n\nBump stocks came into circulation early this century, one of a number of devices that can be attached to automatic weapons.\n\nThe carnage at the Route 91 Harvest Music Festival in Nevada – where the gunman fired more than a thousand rounds from 14 semi-automatic rifles outfitted with bump stocks – prompted the Trump administration to quickly ban them.\n\nGUN OWNERS DUNK ON SHAQ FOR SPONSORING FIREARM BUYBACK EVENT IN RED STATE: 'ABSOLUTELY NOT'\n\nBefore that, the ATF for more than a decade had determined the devices did not convert them into machine guns, which have been illegal to own for nearly a century.\n\nThe ATF says more than a half-million bump stocks were in circulation when the federal ban came into effect five years ago, requiring them to be turned in or destroyed.\n\nThe focus of arguments came down to a technical inquiry into how gun triggers are enhanced by the addition of a bump stock. Several on the court admitted watching videos of bump stocks in a simulated environment, as part of the briefs submitted in the case.\n\nBoth sides presented radically different ideas of just how these accessories work.\n\nThe government told the justices bump stocks allow a gun user to fire \"automatically more than one shot, without manual reloading, by a single function of the trigger.\"\n\nLawyers for the gun dealer argued that despite enhancing the firepower, the effect was still a manual, not an automatic function.\n\n\"The entire point of this device is that you exert forward pressure and you have your finger on the trigger, and then a torrent of bullets shoots out,\" said Justice Elena Kagan. \"So I don't understand why it's any different from pushing a button and holding the trigger.\"\n\nAfter attorney Jonathan Mitchell suggested bump stocks might help someone with a medical condition, Justice Sonia Sotomayor asked, \"Why would even a person with arthritis, why would Congress think they needed to shoot 400 to 7- or 800 rounds of ammunition under any circumstance?\"\n\nBut other questions from the bench went back to what legislators have not done on this issue.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Intuitively I am entirely sympathetic to your argument, and it seems it's functioning like a machine gun would,\" said Justice Amy Coney Barrett, \"but looking at that definition, the question is, why didn't Congress pass that legislation to cover this more clearly?\"\n\nThe technical analysis undertaken during arguments was not without its hiccups.\n\n\"This is totally confusing,\" said Alito at one point. Jackson used the same word on several other occasions.\n\n\"Now I'm completely lost,\" added Sotomayor at one point.\n\nCargill, an Army veteran, is being defended in court by the New Civil Liberties Alliance.\n\n\"If a federal agency can issue a rule that makes people felons for owning a device the agency had repeatedly and consistently approved as lawful for more than a decade, then everyone's liberty is truly in jeopardy,\" said Mark Chenoweth, the group's president.\n\nSupporters of the ban say it saves lives.\n\n\"Fully automatic firearms – and conversion devices – are already heavily regulated under federal law, with good reason,\" said Esther Sanchez-Gomez, litigation director at the Giffords Law Center. \"ATF’s classification of bump stocks as machine guns is simply common sense, and in line with congressional intent to regulate workarounds to the machine gun regulations.\"\n\nA ruling is due by early summer.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "NYC mayor continues calls for sanctuary city amendment to allow deportation of violent illegal immigrants",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/01/NYC-Mayor-Adams-praised-by-police-union.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/KJP-1.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/01/1200/675/ERIC-ADAMS-NEWS-CONFERENCE-NEW-YORK-CITY.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/08/1200/675/GettyImages-1588549707.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/01/1200/675/ERIC-ADAMS-CONFERENCE.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/08/348/196/57c30e6b-Trump-Smith.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/7abd38dd-a6be-4db8-942f-5e5485b3fff0/09d4706c-6602-40eb-9109-39289c8e538e/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/01/NYC-Mayor-Adams-praised-by-police-union.jpg"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/nyc-mayor-calls-sanctuary-city-amendment-allow-deportation-violent-criminals",
            "date": "Wed, 28 Feb 2024 13:31:00 GMT",
            "short_description": "NYC mayor continues calls for sanctuary city amendment to allow deportation of violent illegal immigrants  Fox News",
            "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nNew York City Mayor Eric Adams is seeking to amend the city's sanctuary laws to exclude illegal migrants who have committed violent crimes.\n\nAdams has mentioned his desire to tighten the city's regulations on illegal migrants multiple times this week, with his latest at a Tuesday press conference.\n\n\"I don’t believe people who are violent in our city and commit repeated crimes should have the privilege of being in our city,\" Adams said on Tuesday.\n\nNYC MAYOR ERIC ADAMS DOUBLES DOWN ON CALL FOR CHANGES TO CITY'S 'SANCTUARY' STATUS AMID MIGRANTS CRISIS\n\nHe added, \"You don’t have the right to be in our city and tarnish the overwhelming number who are here following the rules.\"\n\nThis echoes the New York City mayor's previous remarks made during a Q&A session at an event on Monday.\n\n\"The overwhelming amount of migrants that are here, they want to work. I still don’t understand why the federal government’s not allowing them to work,\" Adams said Monday. \"They need to have the right to work like all of us that have come to this country had the ability to do so.\"\n\nMAYOR ERIC ADAMS SAYS NEW YORK CITY HAS 'RUN OUT OF ROOM' FOR MIGRANTS: 'IT'S NOT GOING TO GET ANY BETTER'\n\n\"But those small numbers that are committing crimes, we need to modify the sanctuary city law that if you commit a felony, a violent act, we should be able to turn you over to [Immigration and Customs Enforcement] and have you deported.\"\n\nHe added, \"It is a right to live in this city, and you should not be committing crimes in our city. Right now, we don’t have the authority to do so.\"\n\nAdams commended his administration on Monday for doing an excellent job during a challenging time, but he stated his hands are tied by federal and local law.\n\nCLICK TO GET THE FOX NEWS APP\n\nThe mayor spoke about some migrants participating in robberies and using mopeds to commit snatch-and-grab stick-ups.\n\nAdams has said before that migrants committing crimes should be handed over to ICE and deported.\n\nFox News Digital's Greg Wehner contributed to this report.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Biden health summary released by White House, president called 'healthy, robust'",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2023/02/Biden.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/KJP-1.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/680b7562-d83b-40ef-b7c0-2960e8800b88/c3b343c4-fafb-42c4-b5d1-0a5cdbb96c08/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2023/02/Biden.jpg",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/1200/675/Biden.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/10/340/340/IMG_0731.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/biden-health-summary-released-white-house-president-called-healthy-robust",
            "date": "Wed, 28 Feb 2024 21:43:58 GMT",
            "short_description": "Biden health summary released by White House, president called 'healthy, robust'  Fox News",
            "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nPresident Biden was declared a \"healthy, robust 81-year-old,\" following his physical examination.\n\nIn a release from Dr. Kevin O'Connor, the Physician for the President, Biden was declared fit to \"successfully execute the duties of the presidency.\"\n\n\"President Biden is a healthy, active 81-year-old male, who remains fit to successfully execute the duties of the Presidency, to include those as Chief Executive, Head of State and Commander in Chief,\" the release said.\n\nUnder the note for Biden's physical exam, Dr. O'Connor found that the president's physical exam was \"essentially unchanged from baseline.\"\n\nO'Connor also said that Biden's gait remains stiff but \"has not worsened\" from last year.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "NY AG taunts Trump about interest he owes on civil fraud judgment",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/Trump-and-Letitia-James.png",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/GettyImages-2016269048.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/Trump-and-Letitia-James.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2021/10/340/340/Danielle-Wallace-headshot.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/Trump-and-Letitia-James.png?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/GettyImages-2036450814.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/d4fcf2b2-538d-463c-98bf-9d3b60faef85/c4a05e22-8156-459e-b32a-38095c2cae57/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/AP24059679895953.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/ny-ag-taunts-trump-interest-he-owes-civil-fraud-judgment",
            "date": "Tue, 27 Feb 2024 15:36:00 GMT",
            "short_description": "NY AG taunts Trump about interest he owes on civil fraud judgment  Fox News",
            "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nNew York Attorney General Letitia James appeared to taunt former President Trump about the interest he may own in a civil fraud judgment.\n\nTrump's legal team on Monday appealed a Feb. 16 ruling from New York Judge Arthur Engoron's finding him liable for more than $350 million in damages in the civil fraud case brought against him by James. Engoron ordered Trump to pay just over $354 million, with post-judgment interest accruing at nearly $112,000 per day.\n\n\"In a massive victory, we won our case against Donald Trump for engaging in years of incredible financial fraud to enrich himself. Trump, Donald Trump, Jr., Eric Trump, and his former executives must pay over $450 million in disgorgement and interest,\" James wrote on X, celebrating on the same day of the judgment.\n\nOn Feb. 23, James, who has denied having a \"personal vendetta\" against Trump despite remarks suggesting otherwise, posted flatly, \"$464,576,230.62.\"\n\n\"+$114,553.04,\" she added in another post the next day, referring to the potential added interest Trump may be on the hook for.\n\nTRUMP APPEALS RULING IN MASSIVE NY CIVIL FRAUD CASE\n\nAgain, on Feb. 25, James posted, \"+$114,553.04 = $464,805,336.70.\"\n\nJames' case also targeted Trump's family and the Trump Organization.\n\nEngoron ruled that Trump and co-defendants – his adult sons, Donald Trump Jr. and Eric Trump and two former Trump Organization executives – were liable for \"persistent and repeated fraud,\" \"falsifying business records,\" \"issuing false financial statements,\" \"conspiracy to falsify false financial statements,\" \"insurance fraud,\" and \"conspiracy to commit insurance fraud.\"\n\nThe former president’s lawyers filed notices of appeal Monday, asking the state’s mid-level appeals court to overturn Engoron’s Feb. 16 verdict in James’ lawsuit and reverse staggering penalties that threaten to wipe out Trump’s cash reserves.\n\nTrump’s lawyers wrote in court papers that they are asking the appeals court to decide whether Engoron \"committed errors of law and/or fact\" and whether he abused his discretion or \"acted in excess\" of his jurisdiction. A notice of appeal starts the appeals process in New York. Trump's lawyers will have an opportunity to expand on their grievances in subsequent court filings.\n\nTRUMP VISITS MANHATTAN COURT TO BLAST NYAG CASE, PRAISES APPELLATE RULING IN HIS FAVOR\n\nTrump was not required to pay his penalty or post a bond in order to appeal, and appealing will not automatically halt enforcement of the judgment.\n\nThe Republican presidential frontrunner has until March 25 to secure a stay, a legal mechanism pausing collection while he appeals. Trump would receive an automatic stay if he puts up money, assets or an appeal bond covering what he owes. Trump’s lawyers could also ask the appeals court to grant a stay without obtaining a bond or with a bond for a lower amount.\n\nThere was no indication on the court docket Monday that Trump had already posted an appeal bond or asked for a stay, according to The Associated Press.\n\n\"We trust that the Appellate Division will overturn this egregious fine and take the necessary steps to restore the public faith in New York’s legal system,\" Trump lawyer Alina Habba said.\n\nTrump maintains that he is worth several billion dollars and testified last year that he had about $400 million in cash, in addition to properties and other investments.\n\nJames, a Democrat, told ABC News that if Trump is unable to pay, she will seek to seize some of his assets.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nTrump said Engoron’s decision, the costliest consequence of his recent legal battles, was \"election interference\" and \"weaponization against a political opponent.\" Trump said he was being punished for \"having built a perfect company, great cash, great buildings, great everything.\"\n\nFox News' Anders Hagstrom and The Associated Press contributed to this report.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Biden after annual physical says 'everything's great'",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/joe-biden-health.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/KJP-1.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/9fb41899-3cf5-48d5-ae4a-b024b0dd5ef7/db8f2d83-ee3a-4992-9d92-f8cebdf07a75/1280x720/match/720/405/image.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/joe-biden-health.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/951b85ef-295b-46e2-82a4-261f8fa83378/f47a795d-4585-4f4f-9773-e83b73cf76a1/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/joe-biden-health.jpg",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/joe-biden-health-2.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/biden-annual-physical-says-everythings-great",
            "date": "Wed, 28 Feb 2024 19:44:07 GMT",
            "short_description": "Biden after annual physical says 'everything's great'  Fox News",
            "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nPresident Biden told reporters on Wednesday that his annual physical exam at Walter Reed National Military Medical Center went \"great,\" tamping down concerns over his health as the presidential election draws near.\n\nBiden had just finished delivering remarks on how his administration’s policies on fighting crime in communities across the country are working when one reporter can be heard shouting if there’s anything Americans should know following his annual doctor’s visit.\n\n\"Well, they think I look too young,\" Biden replied.\n\nBiden assured reporters that \"everything’s great\" regarding the check-up and that \"there is nothing different than last year.\"\n\nJACK SMITH RESPONDS TO BLISTERING HUR REPORT FOR FIRST TIME, SAYS BIDEN, TRUMP CASES NOT SIMILAR\n\nBiden had revealed earlier Wednesday that he was making an unannounced trip to Walter Reed National Military Medical Center for a physical exam.\n\nThe exam comes after the report from Special Counsel Robert Hur that claimed the president had significant memory issues.\n\nEarlier this month, White House press secretary Karine Jean-Pierre stated that Biden's physician, Dr. Kevin O'Connor, does not believe a cognitive test is necessary. She said O'Connor believes Biden proves his cognitive ability \"every day [in] how he operates and how he thinks.\"\n\nEX-OBAMA AIDES SAY AGE IS ‘VERY REAL ISSUE’ FOR BIDEN, WHO SOUNDS ‘FRAIL,’ ‘MUMBLY’\n\nBiden received his last physical on Feb. 16 of last year, when his physician gave him a clean bill of health in a letter that said Biden was \"fit to successfully execute the duties of the presidency.\"\n\nBiden has undergone yearly physical examinations since the beginning of his term, in line with every other commander in chief since President Richard Nixon.\n\nCLICK TO GET THE FOX NEWS APP\n\nWalter Reed, the hospital used by all presidents for routine medical care and examinations, is located in Bethesda, Maryland.\n\nFox News’ Timothy H.J. Nerozzi contributed to this report.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Laken Riley's murder the 'direct result' of immigration laws passed by NYC Democrats: councilman",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/lakenbill.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2021/06/1200/675/American-cities-victims-of-progressive-wokeness-and-people-are-starting-to-waking-up-NYC-councilman.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/Laken-Riley-UGA-Student-Death_07.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/01/348/196/GettyImages-1938768468-1.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/Haley-Trump.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/10/1200/675/GettyImages-1712266319.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/25e88f0a-54fb-4cf7-beb2-a834134883e0/7926a9bc-bf2b-4250-ad67-7aa1889f20bd/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/06/1200/675/GettyImages-1366293914.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2021/10/1200/675/2021-02-05T184118Z_190136976_RC2IML9LIRQX_RTRMADP_3_HEALTH-CORONAVIRUS-VACCINES-NEWYORK.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/jose-ibarra-mugshot.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/lakenbill.jpg",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/mary_ellen_withrow.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/12/1200/675/Eric-Adams.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2021/09/1200/675/GettyImages-1169848755.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/07/348/196/Supreme-Court.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/laken-rileys-murder-direct-result-immigration-laws-passed-nyc-democrats-councilman",
            "date": "Wed, 28 Feb 2024 23:01:00 GMT",
            "short_description": "Laken Riley's murder the 'direct result' of immigration laws passed by NYC Democrats: councilman  Fox News",
            "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nThe murder of a Georgia nursing student allegedly at the hands of an illegal immigrant who was previously arrested in New York City is the \"direct result\" of recent New York City laws that severed ties between the NYPD and Immigration and Customs Enforcement, Republican Councilman Joe Borelli argued.\n\n\"It is a direct result of the City Council passing legislation that limits cooperation. If those laws were not enacted, the Department of Corrections would have given ICE the opportunity to issue a detainer against Jose Ibarra,\" Borelli told Fox News Digital in a phone interview this week.\n\nGeorgia nursing student Laken Hope Riley, 22, was discovered beaten to death earlier this month after going for a run on the University of Georgia’s campus. The Augusta University student crossed paths with illegal immigrant Jose Antonio Ibarra, according to authorities, and died from blunt force trauma to the head.\n\nIbarra, a Venezuelan national, entered the U.S. illegally in 2022 and was granted border \"parole,\" which allows noncitizens to temporarily enter the country due to an emergency or humanitarian reason, authorities have said. Ibarra soon made his way up to New York City, where he was arrested in August and \"charged with acting in a manner to injure a child less than 17 and a motor vehicle license violation,\" according to ICE.\n\n7.2M ILLEGALS ENTERED THE US UNDER BIDEN ADMIN, AN AMOUNT GREATER THAN POPULATION OF 36 STATES\n\nThe NYPD, however, has said it does not have a record of Ibarra's arrest.\n\nTypically, when ICE learns an illegal immigrant is arrested on criminal charges, the agency will issue a detainer that requests the local police department hold the suspect until ICE can take over and begin deportation proceedings.\n\nIn Ibarra’s case, ICE said he was released by the NYPD before a detainer could be issued.\n\nNew York City, however, is a \"sanctuary city\" with relatively recent laws passed by City Council severing many ties between the NYPD and ICE.\n\nLAKEN RILEY CASE: HECKLERS SHOUT DOWN ATHENS MAYOR AS HE DENIES SANCTUARY CITY, ANNOUNCES PUBLIC SAFETY FUNDS\n\n\"A woman is dead in Georgia because the New York City Council passed local laws barring the NYPD from cooperating with ICE, and as such the suspect was released without any notification to federal law enforcement,\" Borelli tweeted this week, accompanied by a list of laws that restricted local cooperation with the immigration agency.\n\nUnder a pair of 2014 laws, the local Department of Corrections and NYPD were restricted from complying with ICE detainers under certain conditions. The DOC, for example, is only allowed to comply with an ICE detainer if it is accompanied by a warrant from a federal judge and if the suspect has been convicted of a violent crime in the last five years.\n\nLAKEN RILEY MURDER IGNITES DEMANDS TO HIRE MORE CBP AGENTS, REDIRECT $15B DEMOCRAT IRS PAYDAY TO BORDER\n\n\"Our city is not served when New Yorkers with strong ties in the community are afraid to engage with law enforcement because they fear deportation. Today, we send another message to Washington that the time to act has come to provide relief to so many individuals who contribute to our nation’s growth,\" Mayor Bill de Blasio said when the two laws were enacted.\n\n\"I’d like to thank Speaker Melissa Mark-Viverito and the City Council for passing this legislation, which further establishes New York City as a leader in immigration reform.\"\n\nSimilar reforms continued under the de Blasio administration, including in 2017, when the City Council passed a bill prohibiting \"City agencies from partnering with the U.S. Department of Homeland Security to enforce federal immigration law.\"\n\n\"The de Blasio Administration today announced the issuance of citywide guidance and new NYPD protocols to clarify and institutionalize the City’s policy that it will not voluntarily cooperate with federal immigration enforcement activities, and will only coordinate in limited circumstances, including where there is a public safety risk,\" a press release from the de Blasio administration stated of the law at the start of 2018.\n\nBorelli, who has served on City Council representing portions of Staten Island since 2015, argued \"it's interesting to see people trying to backtrack on the impact that these laws have on the cooperation between ICE and city law enforcement.\"\n\nGEORGIA STUDENT MURDER SUSPECT CONFIRMED TO BE ILLEGAL IMMIGRANT\n\n\"But the proof is in the pudding,\" he said.\n\nThe New York Republican pointed to comments made by local politicians when the laws were passed, arguing that Democrats wanted to sever communication between local law enforcement and federal authorities when involving illegal immigrants.\n\n\"The day we start helping ICE is the day we lose the public trust, which is why this guidance and protocol is so critical,\" a former NYC council member said in 2018, when de Blasio announced the prohibition of city agencies partnering with the Department of Homeland Security when related to immigration laws.\n\nCurrent New York City Mayor Eric Adams also supported the measure in 2018, when he served as Brooklyn borough president.\n\nLAKEN RILEY CASE: GEORGIA AUTHORITIES IDENTIFY MURDER SUSPECT IN CUSTODY IN NURSING STUDENT'S SLAYING\n\n\"It is important for our police officers and City employees to have clear guidance and protocol on how to interact with federal immigration enforcement, especially considering the overaggressive behavior of ICE agents. Public safety for all of our residents must come first,\" Adams said, according to the de Blasio-era press release.\n\nFollowing Laken Riley’s murder, Adams said this week that he supports altering city laws that would open the doors to New York City officials working with federal authorities on immigration matters involving violent suspects or repeat offenders.\n\n\"I want to go back to the standards of the previous mayors who I believe subscribed to my belief that people who are suspected of committing serious crimes in this city should be held accountable,\" Adams told reporters at City Hall Tuesday.\n\n\"We should not be allowing people who are repeatedly committing crimes to remain here, and we cannot collaborate with ICE in the process,\" the mayor added.\n\nAdams has repeatedly spoken out in support of keeping New York City as a sanctuary city, saying illegal immigrants in the Big Apple should not live in fear of receiving city services, such as attending a school, due to their immigration status.\n\nWhen asked about Borelli's comments and the laws passed by City Council under his administration, de Blasio told Fox News Digital in a statement that it's time for \"tougher border policies.\"\n\n\"I trust the NYPD, and they say they never encountered the accused individual. But it’s sickening that a young, promising life was cut short. Any way you slice it, we need tougher border policies and comprehensive immigration reform,\" de Blasio said.\n\nThe former mayor also pointed Fox Digital to an opinion piece he wrote this month, in which he proposed accepting \"Republican demands for greater border security in exchange for full funding of a humane and functioning asylum process,\" along with \"spending billions to create the facilities necessary on the Mexican side of the border, including the concessions and incentives the Mexican government would require in order to accept this plan.\"\n\nBorelli argued the push by the City Council to sever ties with federal authorities back when de Blasio was in office evolved from Democrats in the city wanting to resist what they saw as a \"Trump agenda\" on immigration.\n\n\"This was a reaction by the de Blasio administration and the City Council to push back on what they saw as the Trump agenda. And as long as they were doing what they could to oppose Trump, they didn't care,\" he said.\n\nBorelli said the local legislation is now backfiring as New Yorkers and others question the laws’ logic.\n\n\"It's completely backfired when people start to question, ‘What is the logic of having people who are here illegally in the first place, and then commit crimes against New Yorkers and others?’ There's limited rationale for keeping them here, even if you were a progressive who is sympathetic to people coming here in the first place,\" Borelli said.\n\nLaken Riley’s murder has shocked many Americans and heightened outrage about the Biden administration’s border policies. More than 7 million illegal immigrants have flooded the nation since President Biden took office in 2021, a figure larger than the population of 36 individual states, a Fox News Digital analysis previously found.\n\nRiley was reportedly so badly beaten during the murder that her skull was disfigured, investigators reported in an affidavit.\n\n\"He’s a sick puppy,\" Borelli told Fox Digital when asked about the brutal attack. \"[He] would not have withstood screening, we hope, if we had a proper system of vetting and deporting people.\"\n\nIbarra is in custody and was charged with the felonies of malice murder, murder, kidnapping, false imprisonment, aggravated assault, aggravated battery and concealing the death of another, as well as the misdemeanor of physically hindering a 911 call, according to the affidavit filed Feb. 23.\n\nLAKEN RILEY MURDER: MEDIA OUTLETS FOCUS ON LONE JOGGERS, DOWNPLAY SUSPECTED KILLER’S IMMIGRATION STATUS\n\nNew York State Senate Republicans on Wednesday announced the renaming of legislation that would allow local law enforcement agencies to cooperate with ICE. The legislation will now be known as \"Laken's Law\" in memory of Riley.\n\n\"Because of New York law, because of New York sanctuary state laws, local law enforcement do not notify federal immigration officials when they take someone into custody, even if they're here — especially when they're here illegally,\" Republican New York state Sen. Robert Ortt said at a press conference Wednesday.\n\n\"So, Laken Riley's murderer, albeit an alleged murderer, was in custody, law enforcement custody, and he was released without notification to ICE, to federal authorities, because of policies and laws passed by Democrats here in New York State,\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nOrtt argued that if legislation allowing law enforcement to work with ICE were in place back when Ibarra was arrested by the NYPD, Riley \"would be alive today.\"\n\n\"It's not an opinion. It's not what I think. I'm not split. It's a fact. If this was the law of the State of New York, she'd be alive today. Her family would have a daughter today,\" he said.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Jeb Bush comes to Trump’s defense after $355M fraud judgment: 'Damage could cascade'",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/trumpjeb.png",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/Letitia-James.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/b80a03e6-343d-496f-aa15-354a924e6653/b192dd3e-5c1b-4976-b562-779d0a0dce8d/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/trumpjeb5.png?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/trumpjeb2.png?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/trumpjeb.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/trumpincourt.png?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/AP24059679895953.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/1200/675/GettyImages-1780454143.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/jeb-bush-comes-trumps-defense-355m-fraud-judgment-damage-could-cascade",
            "date": "Mon, 26 Feb 2024 15:53:00 GMT",
            "short_description": "Jeb Bush comes to Trump’s defense after $355M fraud judgment: 'Damage could cascade'  Fox News",
            "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nFormer Republican Florida Gov. Jeb Bush came to the defense of former President Trump in a Wall Street Journal op-ed slamming the recent New York civil fraud court case that ordered the 45th president to pay a $354.8 million fine plus interest.\n\n\"Every American has a right to be critical of Mr. Trump’s politics—one of us ran against him in 2016,\" reads Bush’s op-ed, titled, \"Elon Musk and Donald Trump Cases Imperil the Rule of Law.\"\n\n\"…But equality before the law is precious, and these rulings represent a crisis not only for the soundness of our courts, but for the business environment that has allowed the U.S. to prosper,\" the opinion piece continued. \"If these rulings stand, the damage could cascade through the economy, creating fear of arbitrary enforcement against entrepreneurs who seek public office or raise their voices as citizens in a way that politicians dislike.\"\n\nThe column, which was co-authored by Palantir co-founder Joe Lonsdale, railed against the recent monthslong civil fraud trial against Trump, which resulted in a nearly $355 million fine and bars Trump from operating his business in New York for three years. The opinion piece also spoke out against how a Delaware judge recently rescinded tech billionaire Elon Musk's $56 billion compensation from Tesla.\n\nTRUMP BLASTS 'CLUBHOUSE POLITICIAN' JUDGE AFTER BEING FINED $350M, DEFENDS THE 'GREAT COMPANY' HE BUILT\n\nBush ran against Trump in the 2016 presidential election, when the two exchanged repeated barbs, including personal jabs such as Trump claiming Bush is an \"embarrassment to his family.\" In 2018, Bush said Trump is \"Republican in basically name only\" and took another apparent stab at the then-president, saying after he bowed out of the primary that he returned home where his children \"actually love me.\"\n\nFollowing Jan. 6, 2021, when supporters of Trump breached the U.S. Capitol, the former Florida governor said Trump \"provoked the disgusting events at the Capitol today.\"\n\n\"He has gone from creating chaos to inciting insurrection,\" Bush said in a post at the time. \"Mr. President, accept your defeat, go home to Florida and let our elected officials do their jobs and rebuild confidence in our democracy.\"\n\nTRUMP BACKS GEORGE P. BUSH, JEB'S SON, IN TEXAS POLITICAL RACE\n\nThe op-ed marks a defense of Bush's former 2016 rival, albeit not for Trump’s political stances. Instead, Lonsdale and Bush are calling for a \"dispassionate\" legal system that will not throttle businesses and lead to a weakened economy.\n\n\"​​New York and Delaware have played an outsize role in business in the U.S.\" the pair wrote. \"Many major companies are incorporated in Delaware owing to the state’s body of corporate legal precedents; and a significant number of banks operate in New York, the world financial capital. The appellate courts in those states now have a chance to review these dangerous judicial rulings and try to stop further damage to the reputations of their respective judiciaries.\"\n\n\"If they don’t, blue-state politicians may have the satisfaction of ‘sticking it’ to Messrs. Trump and Musk, but the loss to those states will be significant,\" they continued. \"The damage to the legal fabric of the country will be even worse. A dispassionate justice system is at the heart of American exceptionalism, and the country will be poorer if we lose it.\"\n\nTrump has since appealed the ruling and repeatedly argued that the presiding judge, Arthur Engoron, and New York Attorney General Letitia James were politically motivated in the case.\n\nFORMER TRUMP RIVAL JEB BUSH CALLS MANHATTAN GRAND JURY INDICTMENT 'VERY POLITICAL'\n\n\"A crooked New York judge working with the very corrupt attorney general of New York State, who ran on the basis of ‘I will get trump’ before knowing me — before even knowing anything about me — just ruled that I have to pay a fine of $355 million based on absolutely nothing,\" Trump told Fox News Digital after the fine was announced. \"No victims. No damages. Great financial statements, with full disclaimer clauses, only success.\"\n\nNEW YORK AG TAKES VICTORY LAP AFTER TRUMP FRAUD RULING: 'JUSTICE HAS BEEN SERVED'\n\nThe op-ed noted that when James was on the campaign trail for the attorney general position, she ran on a campaign \"promise to target the man she called 'an illegitimate president.’\"\n\n\"The unusual New York law Ms. James used to investigate and sue Mr. Trump didn’t require her to prove that he had intended to defraud anyone, or even that anyone lost money. The Associated Press found that of the 12 cases brought under that law since its adoption in 1956 in which significant penalties were imposed, the case against Mr. Trump was the only instance without an alleged victim or financial loss,\" the pair wrote.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nTrump attorneys had asked Engoron to delay enforcement of the payment by 30 days to allow time for an \"orderly post-judgement process,\" which was denied Thursday afternoon.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Fox News Politics: McConnell's 'sprint to the finish line'",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2023/11/Mitch-McConnell.gif",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/KJP-1.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2023/11/Mitch-McConnell.gif",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/GettyImages-2030863291.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/10/1200/675/GettyImages-1255040527.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/fox-news-politics-mcconnells-sprint-to-the-finish-line",
            "date": "Wed, 28 Feb 2024 19:54:05 GMT",
            "short_description": "Fox News Politics: McConnell's 'sprint to the finish line'  Fox News",
            "text": "Welcome to Fox News’ Politics newsletter with the latest political news from Washington D.C. and updates from the 2024 campaign trail.\n\nWhat's Happening?\n\n-Biden makes unannounced visit to Walter Reed Medical Center\n\n-Hunter Biden testifies behind closed doors to Congress as part of impeachment inquiry\n\n-Trump wins Michigan's GOP primary\n\nEnd of an Era\n\nLongtime Republican leader Sen. Mitch McConnell , R-Ky., announced Wednesday he will step away from leadership in November.\n\nMcConnell, who turned 82 last week, announced his decision in an emotional speech in the Senate shortly after noon.\n\n\"One of life’s most underappreciated talents is to know when it’s time to move on to life’s next chapter,\" he said. McConnell's first Senate term started in 1985, under the late President Reagan, and McConnell remained a huge fan (despite Reagan at first calling him \"Mitch O'Donnell -- Close enough\"). But McConnell didn't reminisce much.\n\n\"There'll be plenty of time to express my gratitude and greater detail as I sprint towards the finish line, which is now in sight,\" he said.\n\nMcConnell's dramatic decision, which will set up a leadership election in the GOP conference after the November election, comes as Republicans have expressed increasing discontent with McConnell's handling of the bipartisan border bill and national security supplemental package that included aid for Ukraine, Israel and Taiwan.\n\nMcConnell has also butted heads with former President Trump, the 2024 Republican presidential front-runner, who said at a Fox News town hall recently: \"I don't know that I can work with [McConnell].\"\n\nYet after McConnell's announcement, gratitude poured in from both McConnell's allies and his critics. \"I’m grateful for his service.... I think Mitch's tenure has had many legacies. But no legacy is more consequential than the nomination and confirmation of hundreds of principled constitutionalists to the federal judiciary. And that is a lasting benefit to the American people for which I'm deeply grateful,\" Texas Sen. Ted Cruz told reporters.\n\nMcConnell said he intends to finish his current Senate term, which ends in January 2027. Sources familiar with his thinking told Fox News Digital the senator's health was not a factor in his decision. McConnell had a concussion after a fall last year and two public episodes when he appeared to freeze while addressing reporters.\n\nWhite House\n\nNO TO JOE: Hamas officials shut down Biden's ice-cream diplomacy, rejects cease-fire deal …Read more\n\nBIDEN'S PHYSICAL: Biden made an unannounced visit to Walter Reed for a physical exam …Read more\n\nCapitol Hill\n\n'HUNTED ME': Hunter Biden says he 'did not involve' his father in his business dealings, blasts impeachment inquiry …Read more\n\n'EXTREMIST POLICIES': GOP senator fights back against Biden's 'gun-grabbing agenda' to defend gun dealers …Read more\n\n'CONCERNING BEHAVIOR': Sen. Cotton wants to know how US airman who lit himself on fire was active duty …Read more\n\nGEORGIA LAWMAKERS MOURN: House GOP lawmakers from Georgia blame Biden's 'disastrous' border policies for murder of Laken Riley …Read more\n\nTales from the Campaign Trail\n\nVICTORIOUS: Trump wins Michigan GOP Primary …Read more\n\nBATTLEGROUND VICTORY: Biden wins Michigan despite pushback from Arab-American voters …Read more\n\nSUPER REMATCH: Michigan inches Biden and Trump closer to 2020 rematch as 'Super Tuesday' approaches …Read more\n\nBREAKING NEWS: Dem candidate 'unsuspending' presidential campaign against Biden …Read more\n\nCALLING FOR HELP: Biden campaign sees Michigan voters back 'uncommitted,' immediately takes action …Read more\n\nAcross America\n\nPARTY TRANSFORMATION: Lara Trump officially announces campaign for RNC co-chair as Trump loyalists move in …Read more\n\nCLOSE THE GATES: NYC mayor calls for sanctuary city amendment to allow deportation of violent criminals …Read more\n\nALL APOLOGIES: San Francisco apologizes to black citizens for 'decades of systemic and structural discrimination' …Read more\n\n'PROGRESSIVE WORLDVIEW': Soros-backed group unleashes war on gas leaf blowers, trucks …Read more\n\nCONTROVERSIAL CARE: Court rules state can enforce law banning gender-transition treatments for minors …Read more\n\n$1.7 TRILLION ERROR:- Federal judge rules massive congressional spending bill is unconstitutional …Read more\n\nSubscribe now to get Fox News Politics newsletter in your inbox.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        }
    ]
}