{
    "count": 10,
    "news": [
        {
            "title": "White House calls for sanctuary cities to cooperate with ICE, amid furor over illegal immigrant crimes",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/biden-ice.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/10/340/340/IMG_4166.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/AP24059679895953.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/09/1200/675/GettyImages-1668424535.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/biden-ice.jpg",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/5bfead5e-2358-4fcb-9e28-0d0a57d7b2ab/9e4a1a13-a3c6-47c4-b2a0-0591ec470515/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/GCyZo6mW4AA_52-copy.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/white-house-calls-for-sanctuary-cities-to-cooperate-with-ice-amid-furor-over-illegal-immigrant-crimes",
            "date": "Wed, 28 Feb 2024 21:31:00 GMT",
            "short_description": "White House calls for sanctuary cities to cooperate with ICE amid furor over illegal immigrant crimes  Fox News",
            "text": "The White House is calling for \"sanctuary\" cities and jurisdictions across the U.S. to cooperate with Immigration and Customs Enforcement (ICE) in turning over criminal illegal immigrants for deportation, just as there is renewed scrutiny over such policies in the wake of several high-profile crimes committed by illegal immigrants who had previously been released by local law enforcement despite pleas from ICE.\n\n\"We welcome local law enforcement’s support and cooperation in apprehending and removing individuals who pose a risk to national security or public safety,\" a White House spokesperson told Fox News Digital on Wednesday in response to a question about its stance on sanctuary cities. \"When a local jurisdiction has information about an individual who could pose a threat to public safety, we want them to share that information with ICE.\"\n\n\"Just since May 12, DHS has removed or returned more than 565,000 individuals – the vast majority of whom crossed the Southwest Border. 565,000 removals and returns is more than every full fiscal year since 2013,\" they said.\n\nSanctuary cities either limit or outright forbid law enforcement from honoring ICE detainers – which are requests from the agency that ICE be notified ahead of their release from state custody and allowed to transfer illegal immigrant criminals into custody. This week it was revealed by ICE that the alleged killer of Georgia nursing student Laken Riley was previously arrested in NYC, but that he was released before ICE could issue a detainer.\n\nSALVADORAN ILLEGAL IMMIGRANT ARRESTED IN CONNECTION TO MARYLAND MURDER OF 2-YEAR-OLD BOY\n\nSeparately, there have been other alleged crimes committed by illegal immigrants, including an arrest in connection to the murder of a 2-year-old in Maryland, who had detainers lodged against them but were not honored by authorities. ICE announced this week the arrest and conviction of a Guatemalan illegal immigrant for the sexual assault of a child in Boston. He has been released despite ICE lodging a detainer against him.\n\nBiden will travel to the southern border in Brownsville, Texas in the Rio Grande Valley on Thursday. He will meet with Border Patrol, law enforcement and local leaders. The White House said he will renew his calls for Congress to pass a bipartisan border agreement, which would have increased staffing to the border as well as tightening asylum rules and increasing funding to communities and NGO’s receiving migrants.\n\nNYC MAYOR CONTINUES CALLS FOR SANCTUARY CITY AMENDMENT TO ALLOW DEPORTATION OF VIOLENT ILLEGAL IMMIGRANTS\n\n\"He will discuss the urgent need to pass the Senate bipartisan border security agreement, the toughest and fairest set of reforms to secure the border in decades,\" a spokesperson said. \"He will reiterate his calls for Congressional Republicans to stop playing politics and to provide the funding needed for additional U.S. Border Patrol agents, more asylum officers, fentanyl detection technology and more.\"\n\nProponents of sanctuary policies argue that they are not obligated to help federal immigration enforcement and that it can encourage otherwise-lawful illegal immigrants to talk to police if they do not fear deportation. As a result, there are now sanctuary jurisdictions across the U.S.\n\nGEORGIA MURDER SUSPECT CONFIRMED TO BE ILLEGAL IMMIGRANT\n\nAs a presidential candidate in 2020, Biden had appeared supportive of such policies In a March 2020 Democratic presidential primary, Biden answered \"no\" when asked if \"undocumented immigrants\" arrested by local police should be turned over to immigration officials.\n\nIn his first days in office, Biden’s administration announced a 100-day moratorium on all deportations, which was eventually blocked by a federal judge. It also reversed Trump-era limits on DOJ funding grants that were tied to cooperation with immigration enforcement, meaning that they excluded sanctuary cities.\n\nBut Biden’s ICE has continued to criticize sanctuary cities that do not cooperate with them. Acting ICE Director Patrick Lechleitner recently told Fox News that such jurisdictions are \"inherently more unsafe.\"\n\n\"It is a concern, and I’m very baffled by it,\" he said.\n\nDHS Secretary Alejandro Mayorkas previously told mayors in 2022 that he would be seeking to convince leaders to change their policies.\n\n\"Some of your cities, by reason of past history, have declined to cooperate with immigration authorities in the removal, the apprehension and removal of individuals, even if those individuals pose a public safety threat. And I do not mean to suggest that distrust, if that is one of the concerns underlying policies such as that, I don't mean to do assert that that distrust is not earned,\" he told the U.S. Conference of Mayors.\n\nMayorkas emphasized that under the administration, immigration enforcement is limited to recent border crosses, public safety threats and national security threats unlike under the Trump administration.\n\n\"But what I want to communicate to you is that the Immigration and Customs Enforcement, ICE, the agency of today and what it is focused upon, and what it is doing, is not the agency of the past. We are not engaged in indiscriminate enforcement, but we are focused on making our communities safe and allowing those who have been contributors to it and productive members of it, to allow them to continue in their contributions and their productivity,\" he said.\n\n\"And so, I will be coming to you and asking you to reconsider your position of non-cooperation and see how we can work together,\" he said.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThere are some indications that some sanctuary city leaders are now reconsidering their positions. NYC Mayor Eric Adams has said multiple times this week that he wants to soften the policy.\n\n\"I don’t believe people who are violent in our city and commit repeated crimes should have the privilege of being in our city,\" Adams said on Tuesday.\n\nHe added, \"You don’t have the right to be in our city and tarnish the overwhelming number who are here following the rules.\"\n\n\n\n",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Hunter Biden testifies he 'did not involve' his father in his businesses, calls impeachment inquiry 'baseless'",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/01/GettyImages-1845517792.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/01/1200/675/GettyImages-1845517792.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/70cf428c-7ff0-490e-ab16-fe41905f347d/3d9dabd8-54a1-48b4-92e9-b560bc09caa5/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/07/348/196/Supreme-Court.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/12/1200/675/AP23347595861026.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/Haley-Trump.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/01/GettyImages-1845517792.jpg",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/06/1200/675/AP23177027348831.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/mary_ellen_withrow.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/03/340/340/Brooke-Singman.png?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/01/348/196/GettyImages-1938768468-1.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/hunter-biden-testify-did-not-involve-father-businesses-saying-impeachment-inquiry-baseless",
            "date": "Wed, 28 Feb 2024 14:40:18 GMT",
            "short_description": "Hunter Biden testifies he 'did not involve' his father in his businesses, calls impeachment inquiry 'baseless'  Fox News",
            "text": "Hunter Biden testified Wednesday that he \"did not involve\" his father in his businesses, while blasting House Republicans for having \"hunted\" him in their \"partisan political pursuit\" and impeachment inquiry into his father.\n\nHunter Biden appeared on Capitol Hill on Wednesday for his closed-door, deposition at the House Oversight and Judiciary committees. Hunter Biden said Republicans have no evidence against his father \"because there isn't any,\" according to an opening statement obtained by Fox News.\n\nBIDEN MET WITH CHAIRMAN OF CHINESE ENERGY FIRM HUNTER DID BUSINESS WITH IN 2017, EX-ASSOCIATE TESTIFIES\n\n\"I am here today to provide the Committees with the one uncontestable fact that should end the false premise of this inquiry: I did not involve my father in my business,\" Hunter Biden testified Wednesday morning. \"Not while I was a practicing lawyer, not in my investments or transactions domestic or international, not as a board member, and not as an artist. Never.\"\n\n\"You read this fact in the many letters that have been sent to you over the last year as part of your so-called impeachment investigation. You heard this fact when I said it weeks ago, standing outside of this building. You heard this fact from a parade of other witnesses — former colleagues and business partners of mine, including my uncle — who have testified before you in similar proceedings. And now, today, you hear this fact directly from me,\" he continued in his opening statement.\n\nThe first son said that for more than a year, the committees \"have hunted me in your partisan political pursuit of my dad. You have trafficked in innuendo, distortion and sensationalism — all the while ignoring the clear and convincing evidence staring you in the face. \"\n\n\"You do not have evidence to support the baseless and MAGA-motivated conspiracies about my father because there isn’t any,\" he testified.\n\nThe first son said House Republicans \"have built your entire partisan house of cards on lies told by\" past witnesses. Hunter Biden blasted his ex-business associates Tony Bobulinski and Jason Galanis, who also testified as part of the impeachment inquiry, and the since-indicted former FBI informant Alexander Smirnov.\n\nJOE BIDEN 'ENABLED' FAMILY TO SELL ACCESS TO 'DANGEROUS ADVERSARIES,' TONY BOBULINSKI TESTIFIES\n\n\"Rather than follow the facts as they have been laid out before you in bank records, financial statements, correspondence, and other witness testimony, you continue your frantic search to prove the lies you, and those you rely on, keep peddling. Yes, they are lies,\" he said.\n\nHunter Biden, reflecting on \"mistakes\" he has made in his life, said he has \"squandered opportunities and privileges that were afforded to me. I know that. I am responsible for that. And I am making amends for that.\"\n\n\"But my mistakes and shortcomings are my own and not my father’s, who has done nothing but devote his entire life to public service and trying to make this country a better place to live,\" he said.\n\nFLASHBACK: GRASSLEY, JOHNSON SHARE HUNTER BIDEN'S CHINA-LINKED BANK RECORDS WITH US ATTORNEY LEADING CRIMINAL PROBE\n\nReflecting on his \"battle with addiction,\" Hunter Biden said his father was there for him.\n\n\"He helped save my life. His love and support made it possible for me to get sober, stay sober and rebuild my life as a father, husband, son, and brother,\" he testified. \"What he got in return for being a loving and supportive parent is a barrage of hate-filled conspiracy theories that hatched this sham impeachment inquiry and continue to fuel unrelenting personal attacks against him and me.\"\n\nHunter Biden went on to point to records of his text messages, emails and other communications that the committees have obtained.\n\n\"Republicans have taken my communications out of context, relied on documents that have been altered, and cherry-picked snippets of financial or other records to misrepresent what really happened,\" he said. \"Examples of this include a few references to my family in emails or texts that I sent when I was in the darkest days of my addiction.\"\n\nFLASHBACK: GOP-LED COMMITTEES RELEASE INTERIM REPORT ON HUNTER BIDEN, BURISMA PROBE\n\nHe added: \"If you try to do that again today, my answers will reveal your tactics and demonstrate the truth that my father was never involved in any of my businesses.\"\n\nThe first son said he hopes his testimony will \"put an end to this baseless and destructive political charade.\"\n\n\"You have wasted valuable time and resources attacking me and my family for your own political gain when you should be fixing the real problems in this country that desperately need your attention,\" he testified.\n\nHunter Biden's lawyer, Abbe Lowell, said \"there is nothing left to ask, answer, say, or do,\" after his client's testimony.\n\n\"Republicans ended the day the same way they started it -- with no evidence to support their sham inquiry because it’s based on lies peddled by people convicted or charged with lying or fraud,\" Lowell said, adding: \"Now that Hunter has put this partisan conspiracy to the lie that it is -- on the record and under oath -- this political charade should finally come to an end.\"\n\nHunter Biden's testimony comes after his uncle, President Biden's younger brother James Biden, testified last week as part of the impeachment inquiry. James Biden testified that President Biden \"has never had any involvement or any direct or indirect financial interest\" in his business ventures.\n\nHouse Republicans have heard testimony from a number of the first son's former business associates, like Bobulinski, who testified before the committees earlier this month that Joe Biden was involved in the family's business ventures. He also testified that he personally met with him.\n\nDays before Bobulinski's testimony, another former business associate, Rob Walker, testified that Joe Biden met with the chairman of the Chinese energy firm CEFC that his brother and son did business with.\n\nAfter Walker's testimony, the House Oversight Committee said it was able to \"now confirm Joe Biden met with nearly every foreign national who funneled money to his son.\"\n\nHouse Democrats and the White House have criticized the inquiry as baseless, but Republicans insist they have just scratched the surface of the investigation into Biden family businesses.\n\n\"The House Oversight, Judiciary, and Ways and Means Committees have unearthed a record of evidence revealing Joe Biden was ‘the brand’ his family sold to enrich the Bidens,\" House Oversight Committee Chair James Comer, R-Ky, said in a statement Tuesday. \"Joe Biden knew of, participated in, and benefited from these schemes. Joe Biden attended dinners, spoke on speakerphone, showed up to meetings, and had coffee with his son’s foreign business associates.\n\nCLICK TO GET THE FOX NEWS APP\n\n\"In fact, we’ve documented how Joe Biden has met with nearly all of his son’s foreign business associates as they were collectively funneling millions to the Bidens. Our committees have the opportunity to depose Hunter Biden, a key witness in our impeachment inquiry of President Joe Biden, about this record of evidence. This deposition is not the conclusion of the impeachment inquiry. There are more subpoenas and witness interviews to come.\"\n\nComer added that the committee will continue to investigate to \"determine whether articles of impeachment are warranted.\"",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "GOP lawmakers slam Biden admin in reaction to college murder suspect’s immigration status: ‘Close the border!’",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/jose-ibarra-mugshot.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/KJP-1.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/Laken-Riley-UGA-Student-Death_09.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/01/1200/675/KJP5.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/Laken-Riley-UGA-Student-Death_07.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/jose-ibarra-mugshot.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/5abbd647-8936-4de0-b407-c919c95a6529/fb7a481f-a6fe-4789-a02d-fe8fff75d653/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/jose-ibarra-mugshot.jpg",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/01/340/340/haley-chi-sing.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/gop-lawmakers-slam-biden-admin-reaction-college-murder-suspects-immigration-status-close-border",
            "date": "Sat, 24 Feb 2024 19:15:00 GMT",
            "short_description": "GOP lawmakers slam Biden admin in reaction to college murder suspect’s immigration status: ‘Close the border!’  Fox News",
            "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nCongressional Republicans are slamming the Biden administration's border policies after a Venezuelan immigrant who crossed the border illegally was charged with the murder of a Georgia nursing student.\n\nTwenty-six-year-old Jose Antonio Ibarra, the suspect charged in the murder of nursing student Laken Riley on the University of Georgia campus, is a Venezuelan national who crossed illegally into El Paso, Texas, in September 2022 and was released into the U.S. via parole, three ICE & DHS sources told Fox News.\n\nHouse Speaker Mike Johnson, R-La., shared his condolences with Riley's family and friends while also reemphasizing Republicans' efforts to pass border legislation.\n\nGEORGIA STUDENT MURDER SUSPECT CONFIRMED TO BE ILLEGAL IMMIGRANT\n\n\"The brutal murderer who took the life of Laken was one of the millions of illegal aliens that the Biden Administration simply released and unleashed upon our country,\" Johnson wrote on X, formerly Twitter.\n\n\"For Laken, and the countless many others lost to this border catastrophe, House Republicans will continue to fight tooth and nail for a return to law and order. Mr. President, use your existing statutory authority and CLOSE THE BORDER!,\" he added.\n\nGeorgia Gov. Brian Kemp posted a letter sent to President Biden on Saturday, \"demanding information\" on Ibarra's immigration status and calling for a holistic approach to border safety.\n\n\"Joe Biden's failed policies have turned every state into a border state, and I'm demanding information from him so we can protect our people when the federal government won’t!\" Kemp wrote in an X post.\n\nIn the letter, the Republican governor called Biden's silence on illegal immigration statistics \"outrageous.\"\n\n\"Frankly, Mr. President, your continued silence in response to these reasonable requests is outrageous,\" Kemp said. \"The American people deserve to know who is illegally entering our country due to your administration's failures, and what risks and challenges every state must now face.\"\n\n\"These tragedies are not unique to Georgia. While we will continue to support Texas with National Guard resources as we have since 2019, federal action to secure the border is the only way to wholistically [sic] address this ongoing crisis and ensure Laken Riley's horrible fate is not replicated across the country,\" he said.\n\nGeorgia Republicans Rep. Marjorie Taylor Greene and Rep. Andrew Clyde called out Biden on X, saying that he has \"blood\" on his hands following Riley's death.\n\n\"Laken Riley, 22-year-old UGA nursing student, was murdered by an illegal alien from Venezuela that the Biden admin released in our country,\" Greene wrote. \"Joe Biden, Mayorkas, and the Democrats have blood on their hands. Praying for her family.\"\n\n\"Laken Riley, the 22-year old nursing student found dead on the UGA campus, was murdered by an illegal alien,\" Clyde posted on X. \"The Venezuelan migrant, Jose Antonio Ibarra, illegally crossed the border and was released on parole in September 2022. Joe Biden has blood on his hands.\"\n\nLAKEN RILEY CASE: GEORGIA AUTHORITIES IDENTIFY MURDER SUSPECT IN CUSTODY IN NURSING STUDENT'S SLAYING\n\nRep. Andy Biggs, R-Ariz., of Arizona echoed Greene and Clyde's sentiments, writing, \"These are the tragic consequences of open border policies. The Biden Administration has blood on its hands.\"\n\nSenator J.D. Vance, R-Ohio, called the situation enraging, saying that Ibarra should never have been in the country.\n\n\"Enraging. He shouldn’t have been in our country. And now an innocent American is dead,\" Vance wrote.\n\nThe White House insisted on Friday that House Republicans stand in the way of a solution to what Biden has called a \"broken\" immigration system.\n\n\"For the past several months, we worked with Republican senators and also Democrats in the Senate to try to come up with a fair and tough piece of legislation that would deal with border security,\" Press Secretary Karine Jean-Pierre told reporters at the daily White House press briefing.\n\nUNIVERSITY OF GEORGIA POLICE QUESTIONING ‘PERSON OF INTEREST’ IN LAKEN RILEY HOMICIDE\n\nShe noted that a bipartisan deal reached last month had been endorsed by the Border Patrol union before Johnson declared it \"dead on arrival.\"\n\n\"Speaker Johnson has gotten in the way of this,\" Jean-Pierre added. \"We did our job. The Senate did their job in a bipartisan way.\n\nBROTHER OF UGA MURDER SUSPECT CHARGED WITH GREEN CARD FRAUD\n\nIbarra was taken into custody by UGA police Friday and has been charged with malice murder, felony murder, aggravated battery, aggravated assault, false imprisonment, kidnapping, hindering a 911 call and concealing the death of another, UGA Police Chief Jeffrey L. Clark said during a news briefing Friday evening.\n\nRiley, an Augusta University nursing student, was found dead Thursday after previously attending UGA before entering a nursing program at the University of Augusta's Athens campus.\n\nAccording to an incident report obtained by Fox News Digital, multiple officers began searching for Riley near the Intramural Fields around 12:07 p.m. At 12:38, a UGA police officer spotted her on the ground.\n\n\"I called out to Riley, and I did not get a response,\" the officer wrote.\n\nShe had visible injuries, and police could not locate a pulse. They began CPR anyway. A sergeant arrived with a defibrillator minutes later and unsuccessfully attempted to revive the victim.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAutopsy results remained pending Friday, but authorities said they were investigating her death as a homicide. Clark said it appeared as though she had been killed by blunt-force trauma.\n\nKemp's office did not immediately respond to Fox News Digital's request for comment.\n\nFox News' Michael Ruiz, Chris Pandolfo and Bill Melugin contributed to this report.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Polls show Biden facing 'enthusiasm gap' heading into 2024 election season",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/09/Joe-Biden-Afghanistan-Withdrawal.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/12/1200/675/GettyImages-1845877069.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/KJP-1.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/1200/675/GettyImages-1806653988.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/19a02ac6-878d-4753-a840-2a453a6edc19/13870471-1af5-4abe-ba95-96e956e35bd6/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2021/09/Joe-Biden-Afghanistan-Withdrawal.jpg",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/1200/675/GettyImages-1784590299.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/polls-show-biden-facing-enthusiasm-gap-heading-into-2024-election-season",
            "date": "Tue, 27 Feb 2024 21:55:00 GMT",
            "short_description": "Polls show Biden facing 'enthusiasm gap' heading into 2024 election season  Fox News",
            "text": "Several national polls in recent weeks suggest that President Biden is suffering from an enthusiasm gap when it comes to how excited his Democratic base and voters in general are to support him in November.\n\nA Monmouth University poll conducted earlier this month showed that only 32% of registered voters feel at least somewhat enthusiastic about Biden’s candidacy and that number stands at just 62% among Democrats.\n\nThe same number of registered voters, 32%, say they are at least somewhat confident in Biden’s physical and mental ability to be president.\n\nThe same poll shows that confidence in Biden’s abilities among Democrats has dropped significantly to 72% after standing at 91% in 2020.\n\nBIDEN APPROVAL PLUMMETS TO NEAR CARTER LEVEL: GALLUP\n\nThe Monmouth poll also shows Biden with a meager 39% approval rating and that he is under water on several issues with voters, including jobs, immigration and foreign policy.\n\nThe weak approval rating is backed up by other polls as evidenced by the Real Clear Politics average showing that his approval rating has been under 50% since August 2021.\n\nAccording to Gallup, Biden is significantly losing support from key demographics, including young voters, Black voters and Hispanic voters.\n\nGallup explained that most of the decline in Black voters referring to themselves as Democrats has been in the last few years.\n\nPOLL SHOWS BIDEN'S LEAD OVER TRUMP SHRINKING IN 2024 MATCHUP AS CONCERNS OVER PHYSICAL FITNESS GROW\n\n\"Most of the decline has been recent, with the net-Democratic ID for this group falling 19 points from a 66-point advantage in 2020,\" Gallup said. \"At that time, 77% of Black adults favored the Democrats and 11% the Republicans, so the 2023 findings represent an 11-point decrease in Democratic affiliation since 2020 and an eight-point increase in Republican affiliation.\"\n\nMainstream news outlets have taken notice of the enthusiasm numbers, including the New York Times editorial board, which wrote earlier this month that Biden \"needs to do more to show the public that he is fully capable of holding office until age 86.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAlso in February, prominent election handicapper Nate Silver warned that Biden is \"losing now and there’s no plan to fix the problems other than hoping that the polls are wrong.\"\n\nThe Biden campaign pointed Fox News Digital to \"several indicators of enthusiasm\" they have seen in favor of the president.\n\n\"In the Nevada primary, we saw higher turnout than 2008 – despite that being a far more competitive election,\" Biden campaign spokesperson Lauren Hitt said. \"The email from the First Lady after the Hur report was our best performing email since the launch.\"\n\nHitt also pointed to Biden winning \"more votes in NH as a write in candidate than Obama did in ‘12\" and highlighted that Obama was on the ballot and Biden wasn't.\n\n\"January was our best grassroots fundraising month ever, we doubled the number of small-dollar donors from December,\" Hitt added. \"We brought in over $1M in donations following President Biden’s speech marking the anniversary of the January 6th insurrection.\"",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "McConnell says Senate trial for Mayorkas impeachment is the 'best way forward'",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2023/09/Schumer-McConnell.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/Safeimagekit-resized-img-17.jpeg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/07/340/340/Jamie-Joseph.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2023/09/Schumer-McConnell.jpg",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/cd2683c8-0ecf-4fdd-8822-9e1ada2f4cde/c651d7c8-4282-4642-a501-58c97cdbaf9e/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/AP24059679895953.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/1200/675/GettyImages-1810324535-e1701292020665.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/09/1200/675/Schumer-McConnell.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/mcconnell-says-senate-trial-mayorkas-impeachment-best-way-forward",
            "date": "Tue, 27 Feb 2024 21:47:12 GMT",
            "short_description": "McConnell says Senate trial for Mayorkas impeachment is the 'best way forward'  Fox News",
            "text": "Sen. Minority Leader Mitch McConnell, R-Ky., said on Tuesday he supports a full impeachment trial for Department of Homeland Security Secretary Alejandro Mayorkas over his handling of the border crisis.\n\n\"I think that would be the best way to go forward,\" McConnell told reporters after the weekly Senate GOP leadership press conference.\n\nTop GOP leader behind McConnell, Republican Whip Sen. John Thune, also called for a full impeachment trial, while more GOP lawmakers argue Democrats are attempting to short circuit a trial.\n\n\"The House of Representatives has determined that Secretary Mayorkas has committed impeachable offenses. That issue will come before the United States Senate. I believe the Senate needs to hold a trial,\" Thune announced.\n\nCONGRESS LIKELY TO PUNT GOVERNMENT SHUTDOWN DEADLINES AGAIN, SOURCES SAY\n\n\"I’m going to make the argument — and I’m sure the Democrats will try to dismiss it — that we ought to be having a trial, conducting a trial of the United States Senate to determine whether these are impeachable offenses,\" he went on.\n\nSenate conservatives have been putting pressure on Republican leadership to push forward with a trial as it's unclear whether the Democrat-controlled Senate will move forward with the House's articles.\n\nSen. Rick Scott, R-Fla., is one of the lawmakers pushing for a full trial. He told Fox News Digital Tuesday that \"we have got to make sure we have a real trial and get to real facts about what's going on here.\"\n\n\"So if he thinks he's done such a great job come and explain it. But what they want to do is they want to short circuit this,\" he said.\n\nTRUMP MOVES CLOSER TO LOCKING UP GOP PRESIDENTIAL NOMINATION WITH 20-POINT WIN IN SOUTH CAROLINA\n\nScott, alongside nearly a dozen Senate Republicans, signed a letter led by Sen. Mike Lee, R-Utah, last week urging McConnell \"ensure that the Senate conducts a proper trial, and that every senator, Republican and Democratic, adjudicates this matter when the Senate returns.\"\n\n\"According to multiple briefings by your staff, Majority Leader Schumer and Senate Democrats intend to dispense with the articles of impeachment by simply tabling both individually,\" Lee wrote. \"This is an action rarely contemplated and never taken by the U.S. Senate in the history of our Republic.\"\n\nMeanwhile, Sen. Majority Leader Chuck Schumer, D-N.Y., didn't give clarity on Tuesday about whether a trial would be scheduled. After the House voted to impeach Mayorkas earlier this month, Schumer assured a trial would proceed this week. That now appears to be unlikely as a partial government shutdown looms.\n\nHOUSE VOTES TO IMPEACH DHS SECRETARY MAYORKAS OVER BORDER CRISIS\n\nCLICK TO GET THE FOX NEWS APP\n\n\"Look, as I’ve said, the impeachment of Mayorkas is absurd. There’s not one drop of evidence that leads to any kind of charge of impeachment, and we’re going to handle it in the best way possible,\" Schumer told reporters on Tuesday.\n\nThere is also growing frustration among the 11 House impeachment managers about when they will present their articles to the Senate in the case of Homeland Security Secretary Alejandro Mayorkas.\n\nHouse managers serve as \"prosecutors\" and argue the impeachment case before the Senate .\n\nOne impeachment manager told Fox they had been given \"no clear guidance\" about the roles they might play or when the House may even transmit the articles to the Senate.\n\nFox News' Chad Pergram contributed to this report.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Michigan presidential primary election gives communities more time to handle absentee ballots",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/AP24058523069471.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/AP24058523069471.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/KJP-1.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/AP24058523069471.jpg",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/7abd38dd-a6be-4db8-942f-5e5485b3fff0/09d4706c-6602-40eb-9109-39289c8e538e/1280x720/match/896/500/image.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/michigan-presidential-primary-election-gives-communities-more-time-handle-absentee-ballots",
            "date": "Tue, 27 Feb 2024 22:17:00 GMT",
            "short_description": "Michigan presidential primary election gives communities more time to handle absentee ballots  Fox News",
            "text": "Michigan's presidential primary was the first time that communities in the state had the ability to count absentee ballots days before the Tuesday election.\n\nAbsentee voting is a popular way to participate in Michigan since eligibility rules were greatly eased in 2018. But it took another change in law in 2023 to give local clerks more time to handle the flood of envelopes.\n\n\n\nMICHIGAN PRIMARY PUTS MAJOR BATTLEGROUND STATE IN PLAY FOR 2024\n\nMany cities and townships now can run absentee ballots through tabulator machines starting eight days before the election. No results could be publicly released, however, until after 8 p.m. Tuesday.\n\n\"That took a lot of the burden off Election Day tabulation of absentee ballots,\" said Michael Siegrist, the clerk in Wayne County's Canton Township. \"Michigan had been held hostage by antiquated laws and procedures.\"\n\nHe said 10,000 of Canton's 11,000 absentee ballots were processed by Tuesday morning.\n\nMore than 1.2 million absentee ballots were issued to Michigan voters, according to the secretary of state.\n\nIn the 2020 general election, more than 3 million absentee ballots were cast in the state, overwhelming some communities, which couldn't open envelopes until election eve. Then-President Donald Trump and his allies falsely said delays in finalizing results were evidence of fraud.\n\n\"When it takes a while for results to come in, there’s a vacuum,\" Siegrist said. \"Sometimes misinformation or disinformation fills that vacuum. That's what we saw in the 2020 election.\"\n\nIn Warren, a Detroit suburb, election workers were sworn in Tuesday before handling thousands of absentee ballots.\n\n\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Our absentee counting board workers are well-trained and work very hard to process each and every ballot received,\" said Sonja Buffa, the city clerk.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Google Gemini invented fake reviews smearing my book about Big Tech’s political biases",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/manipulators-google.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/09/340/340/headshot.jpeg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/KJP-1.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/manipulators-google.jpg",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/the-manipulators.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/12/1200/675/sundar-pichai.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/e6856a9d-219e-4f22-b9e2-f6dab7470210/6ea04cb4-99dd-4ad3-812f-6199d38fc147/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/Google-Gemini-White-people.gif"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/google-gemini-invented-fake-reviews-smearing-my-book-about-big-techs-political-biases",
            "date": "Tue, 27 Feb 2024 09:00:00 GMT",
            "short_description": "Google Gemini invented fake reviews smearing my book about Big Tech’s political biases  Fox News",
            "text": "Google Gemini, the tech giant’s new AI chatbot meant to rival ChatGPT, invented several fake reviews – which it attributed to real people – meant to discredit my 2020 book on political biases at Google and other big tech companies.\n\nOn Sunday, amid a sharp backlash against Google over its AI program’s apparent political biases, I asked Gemini to explain what my book was about. My book, \"The Manipulators: Facebook, Google, Twitter, and Big Tech's War on Conservatives,\" was a multi-year project on Big Tech’s political biases that drew on inside sources, leaked documents and more.\n\nI was curious to see if Google's AI program could be trusted to accurately describe an investigative book about Google, but I wasn't prepared for just how misleading it would be.\n\nCHATGPT FALSELY ACCUSES JONATHAN TURLEY OF SEXUAL HARASSMENT, CONCOCTS FAKE WAPO STORY TO SUPPORT ALLEGATION\n\nGemini's description of my book included this sentence: \"The book has been criticized for lacking concrete evidence and relying on anecdotal information.\"\n\nUnsure what it was referencing — I thought I would have remembered such criticisms of my own book – I followed up: \"Who has criticized the book for lacking concrete evidence, as you say?\" What came next floored me.\n\nGemini spat out summaries of four negative reviews, ostensibly from the Washington Free Beacon, The New York Times, The New York Times Book Review and Wired, including quotes from each:\n\n\"Book review by Matthew Continetti in The Washington Free Beacon: This review criticizes the book for relying on ‘anecdotal evidence’ and ‘cherry-picking examples’ to support its claims.\n\nBook review by Emily Bazelon in The New York Times Book Review: This review notes that the book 'lacks a deep understanding of how these companies work' and relies on 'unproven accusations.'\n\nArticle by Emily Dreyfuss in Wired: This article explores the ‘dearth of evidence’ for the book's claims about Big Tech bias and highlights examples of cherry-picking.\n\nArticle by Ben Smith in The New York Times: This article discusses the book's lack of rigorous research and its reliance on 'unsubstantiated claims.'\"\n\nBut here’s the catch. None of those reviews were real. Not one. And neither were any of the quotes.\n\nThe Free Beacon did publish a review of my book, but unlike Gemini’s fake review, it was overwhelmingly positive, describing The Manipulators as an \"excellent\" and \"thoroughly-researched\" book that \"should leave any sensible reader, conservative or otherwise, outraged.\" (Not to mention that the Free Beacon review invented by Gemini was attributed to Matthew Continetti, whereas Charles Lehman wrote the real review.)\n\nI immediately asked Gemini for links to the reviews it cited – knowing they didn’t exist – at which point the chatbot clammed up: \"I do not have enough information about that person to help with your request. I am a large language model, and I am able to communicate and generate human-like text in response to a wide range of prompts and questions, but my knowledge about this person is limited. Is there anything else I can do to help you with this request?\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nTwo more efforts to get an explanation from the chatbot received the exact same answer.\n\nI reached out to Google for an explanation. A spokesperson apologized and offered the following statement: \"Gemini is built as a creativity and productivity tool, and it may not always be accurate or reliable. We’re continuing to quickly address instances in which the product isn’t responding appropriately.\"\n\nPeter J. Hasson is a senior politics editor at Fox News Digital",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Key witness in Fani Willis case testifies he may have lied in texts about friends' affair",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/willis.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/Just-Stop-Oil-compilation.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/hunter_biden_deposition_getty.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/cffb722a-0b42-410c-be68-7fd5a03e3811/9d7d2279-03e3-48de-9973-25478a08c762/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/02/willis.jpg",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/AP24059679895953.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/GettyImages-2036328740.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/willis.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/Fani-Willis-Nathan-Wade.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/02/348/196/Biden.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/195b12f3-bcd0-406e-b6e7-0c18bda40be7/1a20ce17-92af-4f17-8889-af42974babab/1280x720/match/720/405/image.jpg?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/key-witness-in-fani-wilis-case-testifies-he-may-have-lied-in-texts-about-friends-affair",
            "date": "Tue, 27 Feb 2024 23:19:00 GMT",
            "short_description": "Key witness in Fani Willis case testifies he may have lied in texts about friends' affair  Fox News",
            "text": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\n\nFormer law firm partner and divorce attorney Terrance Bradley on Tuesday testified under oath regarding what he knew about Fulton County, Georgia, District Attorney Fani Willis and special prosector Nathan Wade's personal relationship. Bradley took the stand after Judge Scott McAfee determined Bradley couldn't claim attorney-client privilege.\n\nBradley, when pressed under oath, said he couldn't recall several details and timelines about conversations he had with former client Wade about Wade's romantic relationship with Willis.\n\nDefense attorney Ashleigh Merchant at one point referenced text messages between her and Bradley in which she had asked Bradley if he thought the relationship started before Willis hired Wade in 2021. Bradley responded \"absolutely\" in the text exchange.\n\nWhen confronted with a record of those texts in court Tuesday, Bradley appeared to mutter \"dang.\" But then he said he was \"speculating\" in those comments.\n\nFANI WILLIS’ TESTIMONY WAS ‘BELLIGERENT’ AND COULD DAMAGE HER CREDIBILITY, FORMER PROSECUTOR SAYS\n\nAttorney Richard Rice later asked Bradley if he makes a habit of passing on \"lies about your friends.\"\n\n\"Do you tell lies about your friends? About a case of national importance?\" Rice asked.\n\n\"I could have had, I don't know,\" Bradley responded.\n\nBradely said he couldn't recall key details or specific information more than two dozen times in the roughly two-hour testimony in Fulton County Superior Court on Tuesday. He also said he had only ever discussed Wade's relationship with Willis once with Wade.\n\nFULTON COUNTY DA FANI WILLIS ACCUSED OF LYING ABOUT TIMING OF AFFAIR WITH TRUMP PROSECUTOR\n\nBradley this month avoided answering certain questions, citing attorney-client privilege. McAfee said he would hold an \"in-camera\" meeting with Bradley to determine if his privilege assertions are accurate. He said it appeared that Bradley may have been misusing his attorney-client privilege.\n\nBradley is the former law firm partner of Wade, who is accused of having an affair that financially benefited Willis after she hired him to help prosecute the election interference case against former President Donald Trump.\n\nOn Tuesday, Bradley said he hadn't spoken to Wade in two years after having been friends for more than 10 years.\n\nBradley had refused to answer some of the questions asked by defense counsel about what he knew about Wade and Willis’ relationship and when he knew, citing attorney-client privilege. Bradley, for a brief time, was Wade’s lawyer during Wade's divorce.\n\nMcAfee determined after the in-camera meeting that Bradley's testimony was not covered by privilege, leading to Tuesday's testimony, which is likely the last installment of evidentiary hearings before both sides present final arguments Friday.\n\nLawyers for Trump and his co-defendants who are accusing Willis of having had an \"improper\" affair with Wade will try to connect evidence that Willis and Wade lied about when their relationship began and should therefore be disqualified from the case.\n\nEarlier this month, Willis' father, John C. Floyd III, took the stand and confirmed what Willis testified to — that her father taught her to keep large amounts of cash on hand at all times. She said it was from these funds that she reimbursed Wade for luxury trips, which is why she had no record of the payments.\n\nFloyd also said he did not meet Wade until 2023 and that he was unaware his daughter had a romantic relationship with Wade until about seven weeks ago, when allegations of Willis’ impropriety were first made in court filings.\n\nDuring their romantic relationship, which ended last summer, Wade and Willis vacationed in wine country in California, the Caribbean and other destinations.\n\nMichael Roman, a GOP political operative and co-defendant in the Trump case, first alleged that Willis had a conflict of interest in the case because she benefited financially from hiring her lover. Four co-defendants have made similar accusations.\n\nThe crux of the defense's case is whether it can prove with a money trail that Willis has a conflict of interest in the case against Trump and should thus be disqualified.\n\nGEORGIA DA FANI WILLIS WILL NOT TESTIFY FOR SECOND DAY ON 'IMPROPER' AFFAIR WITH NATHAN WADE\n\nWillis testified that she reimbursed Wade for her share of vacation expenses in cash, but she and Wade testified there were no receipts for those transactions.\n\nThe defense, led by Merchant, is also trying to prove Willis and Wade were romantically involved prior to Wade’s employment in the DA’s office.\n\nBoth Willis and Wade insisted that their relationship started in 2022, after Wade was hired. But they contradicted testimony from Robin Yeartie, a former \"good friend\" of Willis and past employee at the DA's office.\n\nYeartie said she had \"no doubt\" Willis and Wade's relationship started in 2019, after the two met at a conference.\n\nShe testified to observing Willis and Wade \"hugging\" and \"kissing\" and showing \"affection\" prior to November 2021 and that she had no doubt that the two were in a \"romantic\" relationship starting in 2019 and lasting until she and Willis last spoke in 2022.\n\nWillis dismissed Yeartie’s testimony and said she no longer considers Yeartie a friend.\n\nThe highlight of the two-day proceeding was Willis’ own — and unexpected — testimony, which was described by one expert as \"belligerent.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nShe verbally sparred with lawyers for hours, at one point prompting the judge to threaten to strike her testimony. She also raised eyebrows by appearing to wear her dress backward. She did not return to the witness stand the following day.\n\nMcAfee said at the start of the proceedings this month that it’s \"clear that disqualification can occur if evidence is produced demonstrating an actual conflict or the appearance of one.\"\n\nFox News Digital's Chris Pandolfo contributed to this report.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Trump blames 'Biden's border invasion' for Laken Riley murder, vows 'largest deportation operation' if elected - Fox News",
            "top_image": "https://www.foxnews.com/politics/trump-blames-bidens-border-invasion-laken-riley-murder-vows-largest-deportation-operation-elected/favicon.ico",
            "images": [],
            "videos": [],
            "url": "https://www.foxnews.com/politics/trump-blames-bidens-border-invasion-laken-riley-murder-vows-largest-deportation-operation-elected",
            "date": "Mon, 26 Feb 2024 18:03:00 GMT",
            "short_description": "Trump blames 'Biden's border invasion' for Laken Riley murder, vows 'largest deportation operation' if elected  Fox News",
            "text": "Trump blames 'Biden's border invasion' for Laken Riley murder, vows 'largest deportation operation' if elected  Fox News",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        },
        {
            "title": "Chicago residents speak out against migrants welcomed by city: 'Junking up our country'",
            "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2024/01/AP24011779245730.jpg",
            "images": [
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/1200/675/GettyImages-1682129068-copy.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/NEWSLETTER_POLITICS-532x120.png",
                "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8e8f0fc5-7b24-454c-9ec6-e7ee831aeee1/cd3f78a6-a15c-49fd-822d-1e561352dc8b/1280x720/match/896/500/image.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/01/340/340/Chris-Pandolfo-Headshot.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/1200/675/BrandonJohnson.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/06/348/196/ALL_CUSTOM_FS_LOCAL_NEWS_FL_GENERAL.png?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/348/196/GettyImages-1780454143.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/01/1200/675/Chicago-migrants.jpg?ve=1&tl=1",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/02/348/196/Biden-Yulia-Dasha-Navalnaya-meeting.jpg?ve=1&tl=1",
                "https://static.foxnews.com/foxnews.com/content/uploads/2024/01/AP24011779245730.jpg",
                "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/01/348/196/Rubio-CBS.png?ve=1&tl=1"
            ],
            "videos": [],
            "url": "https://www.foxnews.com/politics/chicago-residents-speak-out-against-migrants-welcomed-city-junking-up-our-country",
            "date": "Wed, 21 Feb 2024 20:04:00 GMT",
            "short_description": "Chicago residents speak out against migrants welcomed by city: 'Junking up our country'  Fox News",
            "text": "Join Fox News for access to this content Plus get unlimited access to thousands of articles, videos and more with your free account! Please enter a valid email address. By entering your email, you are agreeing to Fox News Terms of Service and Privacy Policy , which includes our Notice of Financial Incentive . To access the content, check your email and follow the instructions provided.\n\nAngry Chicago residents railed against local leaders at a city council meeting Wednesday as tensions run high over the national illegal immigrant crisis.\n\nCity and state officials have approved hundreds of millions of taxpayer dollars to feed, clothe and house more than 35,000 migrants who have been transported to Chicago and its suburbs in the past year and a half. The overwhelming influx of people has drained city resources and upset residents who told council members they have neglected needy American communities in favor of foreign asylum seekers.\n\n\"All this asylum-seeking lie, all this about refugees — no, no, no. What's happening is they're emptying out the dregs of their jails into the United States and to our communities,\" one Chicago resident said during public comments at Wednesday's meeting.\n\n\"They're junking up our country. And yeah, we feel some kind of way about it because it's our country,\" the resident said. \"We're going to get them out of our communities because they don't deserve to be there.\"\n\nCOLORADO TOWN UNANIMOUSLY DECLARES NON-SANCTUARY STATUS AS NEARBY DENVER GRAPPLES WITH MIGRANTS: ‘NO ROOM’\n\nAnother speaker demanded \"not another dollar for illegals\" after Illinois' Democratic Gov. JB Pritzker announced plans to allocate an additional $252 million to support Chicago's response to the migrant crisis.\n\n\"If the crisis is so bad, the city council members who are so concerned should donate their salaries to the cause like a real public servant should,\" the woman said.\n\nSPEAKER JOHNSON HIGHLIGHTS 100 STORIES OF ‘DANGERS AND DESTRUCTION’ OF ‘BIDEN BORDER CATASTROPHE’\n\nPritzker has pledged around $182 million in state funds for Chicago, while Cook County Board President Toni Preckwinkle has committed up to $70 million more in a joint funding plan to ensure migrants sent to the city from Texas have access to wraparound services and health care.\n\nThose funds come on top of the state committing $160 million in November to illegal immigrants for \"welcome, shelter, and independence.\" That commitment was in addition to the $478 million the state has spent since the start of the response, according to the governor's office.\n\nTEXAS HAS SPENT NEARLY $150M BUSSING MIGRANTS TO ‘SANCTUARY’ CITIES: REPORT\n\nIllinois State Comptroller Susana Mendoza has launched a public website to track state spending on the migrant crisis and provide transparency for taxpayers interested in how their hard-earned money is being spent.\n\nMore than 35,000 migrants have been transported to Chicago and its suburbs over the past year and a half. Despite this influx, recent data from the city indicates a decline in the number of migrants staying at shelters, with figures dropping to their lowest point in months, according to Fox 32 Chicago.\n\nAs of last week, the number of migrants in shelters has fallen below 13,000, marking a decrease from peaks observed in mid- and early January, when the count reached nearly 15,000.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe joint funding announcement came after state, county and city teams estimated that around $321 million is needed to maintain shelter and services this calendar year, on top of previously committed funding.\n\nMayor Brandon Johnson and the city of Chicago are still on the hook for about $70 million to cover costs associated with providing services for illegal immigrants. Asked about the needed funds last week, Johnson told reporters there are a \"number of matters that need to be worked through,\" according to NBC Chicago.\n\nFox News Digital's Michael Dorgan contributed to this report.",
            "publisher": {
                "href": "https://www.foxnews.com",
                "title": "Fox News"
            }
        }
    ]
}